---
kind: other
id: Methods.T:Autodesk.Revit.DB.IntersectionResult
source: html/eda9cc6a-0fc4-952e-57af-624809f3ca5d.htm
---
# IntersectionResult Methods

Causes the object to release immediately any resources it may be utilizing.